GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 039E1h
// bitfield definitions
NVMADRH_ADR_POSN                         equ 0000h
NVMADRH_ADR_POSITION                     equ 0000h
NVMADRH_ADR_SIZE                         equ 0002h
NVMADRH_ADR_LENGTH                       equ 0002h
NVMADRH_ADR_MASK                         equ 0003h
NVMADRH_ADR8_POSN                        equ 0000h
NVMADRH_ADR8_POSITION                    equ 0000h
NVMADRH_ADR8_SIZE                        equ 0001h
NVMADRH_ADR8_LENGTH                      equ 0001h
NVMADRH_ADR8_MASK                        equ 0001h
NVMADRH_ADR9_POSN                        equ 0001h
NVMADRH_ADR9_POSITION                    equ 0001h
NVMADRH_ADR9_SIZE                        equ 0001h
NVMADRH_ADR9_LENGTH                      equ 0001h
NVMADRH_ADR9_MASK                        equ 0002h
NVMADRH_NVMADR_POSN                      equ 0000h
NVMADRH_NVMADR_POSITION                  equ 0000h
NVMADRH_NVMADR_SIZE                      equ 0002h
NVMADRH_NVMADR_LENGTH                    equ 0002h
NVMADRH_NVMADR_MASK                      equ 0003h
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 039E3h
// bitfield definitions
NVMDAT_DAT_POSN                          equ 0000h
NVMDAT_DAT_POSITION                      equ 0000h
NVMDAT_DAT_SIZE                          equ 0008h
NVMDAT_DAT_LENGTH                        equ 0008h
NVMDAT_DAT_MASK                          equ 00FFh
NVMDAT_DAT0_POSN                         equ 0000h
NVMDAT_DAT0_POSITION                     equ 0000h
NVMDAT_DAT0_SIZE                         equ 0001h
NVMDAT_DAT0_LENGTH                       equ 0001h
NVMDAT_DAT0_MASK                         equ 0001h
NVMDAT_DAT1_POSN                         equ 0001h
NVMDAT_DAT1_POSITION                     equ 0001h
NVMDAT_DAT1_SIZE                         equ 0001h
NVMDAT_DAT1_LENGTH                       equ 0001h
NVMDAT_DAT1_MASK                         equ 0002h
NVMDAT_DAT2_POSN                         equ 0002h
NVMDAT_DAT2_POSITION                     equ 0002h
NVMDAT_DAT2_SIZE                         equ 0001h
NVMDAT_DAT2_LENGTH                       equ 0001h
NVMDAT_DAT2_MASK                         equ 0004h
NVMDAT_DAT3_POSN                         equ 0003h
NVMDAT_DAT3_POSITION                     equ 0003h
NVMDAT_DAT3_SIZE                         equ 0001h
NVMDAT_DAT3_LENGTH                       equ 0001h
NVMDAT_DAT3_MASK                         equ 0008h
NVMDAT_DAT4_POSN                         equ 0004h
NVMDAT_DAT4_POSITION                     equ 0004h
NVMDAT_DAT4_SIZE                         equ 0001h
NVMDAT_DAT4_LENGTH                       equ 0001h
NVMDAT_DAT4_MASK                         equ 0010h
NVMDAT_DAT5_POSN                         equ 0005h
NVMDAT_DAT5_POSITION                     equ 0005h
NVMDAT_DAT5_SIZE                         equ 0001h
NVMDAT_DAT5_LENGTH                       equ 0001h
NVMDAT_DAT5_MASK                         equ 0020h
NVMDAT_DAT6_POSN                         equ 0006h
NVMDAT_DAT6_POSITION                     equ 0006h
NVMDAT_DAT6_SIZE                         equ 0001h
NVMDAT_DAT6_LENGTH                       equ 0001h
NVMDAT_DAT6_MASK                         equ 0040h
NVMDAT_DAT7_POSN                         equ 0007h
NVMDAT_DAT7_POSITION                     equ 0007h
NVMDAT_DAT7_SIZE                         equ 0001h
NVMDAT_DAT7_LENGTH                       equ 0001h
NVMDAT_DAT7_MASK                         equ 0080h
NVMDAT_NVMDAT_POSN                       equ 0000h
NVMDAT_NVMDAT_POSITION                   equ 0000h
NVMDAT_NVMDAT_SIZE                       equ 0008h
NVMDAT_NVMDAT_LENGTH                     equ 0008h
NVMDAT_NVMDAT_MASK                       equ 00FFh
NVMDAT_NVMDAT0_POSN                      equ 0000h
NVMDAT_NVMDAT0_POSITION                  equ 0000h
NVMDAT_NVMDAT0_SIZE                      equ 0001h
NVMDAT_NVMDAT0_LENGTH                    equ 0001h
NVMDAT_NVMDAT0_MASK                      equ 0001h
NVMDAT_NVMDAT1_POSN                      equ 0001h
NVMDAT_NVMDAT1_POSITION                  equ 0001h
NVMDAT_NVMDAT1_SIZE                      equ 0001h
NVMDAT_NVMDAT1_LENGTH                    equ 0001h
NVMDAT_NVMDAT1_MASK                      equ 0002h
NVMDAT_NVMDAT2_POSN                      equ 0002h
NVMDAT_NVMDAT2_POSITION                  equ 0002h
NVMDAT_NVMDAT2_SIZE                      equ 0001h
NVMDAT_NVMDAT2_LENGTH                    equ 0001h
NVMDAT_NVMDAT2_MASK                      equ 0004h
NVMDAT_NVMDAT3_POSN                      equ 0003h
NVMDAT_NVMDAT3_POSITION                  equ 0003h
NVMDAT_NVMDAT3_SIZE                      equ 0001h
NVMDAT_NVMDAT3_LENGTH                    equ 0001h
NVMDAT_NVMDAT3_MASK                      equ 0008h
NVMDAT_NVMDAT4_POSN                      equ 0004h
NVMDAT_NVMDAT4_POSITION                  equ 0004h
NVMDAT_NVMDAT4_SIZE                      equ 0001h
NVMDAT_NVMDAT4_LENGTH                    equ 0001h
NVMDAT_NVMDAT4_MASK                      equ 0010h
NVMDAT_NVMDAT5_POSN                      equ 0005h
NVMDAT_NVMDAT5_POSITION                  equ 0005h
NVMDAT_NVMDAT5_SIZE                      equ 0001h
NVMDAT_NVMDAT5_LENGTH                    equ 0001h
NVMDAT_NVMDAT5_MASK                      equ 0020h
NVMDAT_NVMDAT6_POSN                      equ 0006h
NVMDAT_NVMDAT6_POSITION                  equ 0006h
NVMDAT_NVMDAT6_SIZE                      equ 0001h
NVMDAT_NVMDAT6_LENGTH                    equ 0001h
NVMDAT_NVMDAT6_MASK                      equ 0040h
NVMDAT_NVMDAT7_POSN                      equ 0007h
NVMDAT_NVMDAT7_POSITION                  equ 0007h
NVMDAT_NVMDAT7_SIZE                      equ 0001h
NVMDAT_NVMDAT7_LENGTH                    equ 0001h
NVMDAT_NVMDAT7_MASK                      equ 0080h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 039E5h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_REG_POSN                         equ 0006h
NVMCON1_REG_POSITION                     equ 0006h
NVMCON1_REG_SIZE                         equ 0002h
NVMCON1_REG_LENGTH                       equ 0002h
NVMCON1_REG_MASK                         equ 00C0h
NVMCON1_REG0_POSN                        equ 0006h
NVMCON1_REG0_POSITION                    equ 0006h
NVMCON1_REG0_SIZE                        equ 0001h
NVMCON1_REG0_LENGTH                      equ 0001h
NVMCON1_REG0_MASK                        equ 0040h
NVMCON1_REG1_POSN                        equ 0007h
NVMCON1_REG1_POSITION                    equ 0007h
NVMCON1_REG1_SIZE                        equ 0001h
NVMCON1_REG1_LENGTH                      equ 0001h
NVMCON1_REG1_MASK                        equ 0080h
NVMCON1_NVMREG_POSN                      equ 0006h
NVMCON1_NVMREG_POSITION                  equ 0006h
NVMCON1_NVMREG_SIZE                      equ 0002h
NVMCON1_NVMREG_LENGTH                    equ 0002h
NVMCON1_NVMREG_MASK                      equ 00C0h
NVMCON1_NVMREG0_POSN                     equ 0006h
NVMCON1_NVMREG0_POSITION                 equ 0006h
NVMCON1_NVMREG0_SIZE                     equ 0001h
NVMCON1_NVMREG0_LENGTH                   equ 0001h
NVMCON1_NVMREG0_MASK                     equ 0040h
NVMCON1_NVMREG1_POSN                     equ 0007h
NVMCON1_NVMREG1_POSITION                 equ 0007h
NVMCON1_NVMREG1_SIZE                     equ 0001h
NVMCON1_NVMREG1_LENGTH                   equ 0001h
NVMCON1_NVMREG1_MASK                     equ 0080h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 039E6h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

// Register: PRLOCK
#define PRLOCK PRLOCK
PRLOCK                                   equ 039EFh
// bitfield definitions
PRLOCK_PRLOCKED_POSN                     equ 0000h
PRLOCK_PRLOCKED_POSITION                 equ 0000h
PRLOCK_PRLOCKED_SIZE                     equ 0001h
PRLOCK_PRLOCKED_LENGTH                   equ 0001h
PRLOCK_PRLOCKED_MASK                     equ 0001h

// Register: ISRPR
#define ISRPR ISRPR
ISRPR                                    equ 039F1h
// bitfield definitions
ISRPR_PR_POSN                            equ 0000h
ISRPR_PR_POSITION                        equ 0000h
ISRPR_PR_SIZE                            equ 0003h
ISRPR_PR_LENGTH                          equ 0003h
ISRPR_PR_MASK                            equ 0007h
ISRPR_PR0_POSN                           equ 0000h
ISRPR_PR0_POSITION                       equ 0000h
ISRPR_PR0_SIZE                           equ 0001h
ISRPR_PR0_LENGTH                         equ 0001h
ISRPR_PR0_MASK                           equ 0001h
ISRPR_PR1_POSN                           equ 0001h
ISRPR_PR1_POSITION                       equ 0001h
ISRPR_PR1_SIZE                           equ 0001h
ISRPR_PR1_LENGTH                         equ 0001h
ISRPR_PR1_MASK                           equ 0002h
ISRPR_PR2_POSN                           equ 0002h
ISRPR_PR2_POSITION                       equ 0002h
ISRPR_PR2_SIZE                           equ 0001h
ISRPR_PR2_LENGTH                         equ 0001h
ISRPR_PR2_MASK                           equ 0004h
ISRPR_ISRPR_POSN                         equ 0000h
ISRPR_ISRPR_POSITION                     equ 0000h
ISRPR_ISRPR_SIZE                         equ 0003h
ISRPR_ISRPR_LENGTH                       equ 0003h
ISRPR_ISRPR_MASK                         equ 0007h
ISRPR_ISRPR0_POSN                        equ 0000h
ISRPR_ISRPR0_POSITION                    equ 0000h
ISRPR_ISRPR0_SIZE                        equ 0001h
ISRPR_ISRPR0_LENGTH                      equ 0001h
ISRPR_ISRPR0_MASK                        equ 0001h
ISRPR_ISRPR1_POSN                        equ 0001h
ISRPR_ISRPR1_POSITION                    equ 0001h
ISRPR_ISRPR1_SIZE                        equ 0001h
ISRPR_ISRPR1_LENGTH                      equ 0001h
ISRPR_ISRPR1_MASK                        equ 0002h
ISRPR_ISRPR2_POSN                        equ 0002h
ISRPR_ISRPR2_POSITION                    equ 0002h
ISRPR_ISRPR2_SIZE                        equ 0001h
ISRPR_ISRPR2_LENGTH                      equ 0001h
ISRPR_ISRPR2_MASK                        equ 0004h

// Register: MAINPR
#define MAINPR MAINPR
MAINPR                                   equ 039F2h
// bitfield definitions
MAINPR_PR_POSN                           equ 0000h
MAINPR_PR_POSITION                       equ 0000h
MAINPR_PR_SIZE                           equ 0003h
MAINPR_PR_LENGTH                         equ 0003h
MAINPR_PR_MASK                           equ 0007h
MAINPR_PR0_POSN                          equ 0000h
MAINPR_PR0_POSITION                      equ 0000h
MAINPR_PR0_SIZE                          equ 0001h
MAINPR_PR0_LENGTH                        equ 0001h
MAINPR_PR0_MASK                          equ 0001h
MAINPR_PR1_POSN                          equ 0001h
MAINPR_PR1_POSITION                      equ 0001h
MAINPR_PR1_SIZE                          equ 0001h
MAINPR_PR1_LENGTH                        equ 0001h
MAINPR_PR1_MASK                          equ 0002h
MAINPR_PR2_POSN                          equ 0002h
MAINPR_PR2_POSITION                      equ 0002h
MAINPR_PR2_SIZE                          equ 0001h
MAINPR_PR2_LENGTH                        equ 0001h
MAINPR_PR2_MASK                          equ 0004h
MAINPR_MAINPR_POSN                       equ 0000h
MAINPR_MAINPR_POSITION                   equ 0000h
MAINPR_MAINPR_SIZE                       equ 0003h
MAINPR_MAINPR_LENGTH                     equ 0003h
MAINPR_MAINPR_MASK                       equ 0007h
MAINPR_MAINPR0_POSN                      equ 0000h
MAINPR_MAINPR0_POSITION                  equ 0000h
MAINPR_MAINPR0_SIZE                      equ 0001h
MAINPR_MAINPR0_LENGTH                    equ 0001h
MAINPR_MAINPR0_MASK                      equ 0001h
MAINPR_MAINPR1_POSN                      equ 0001h
MAINPR_MAINPR1_POSITION                  equ 0001h
MAINPR_MAINPR1_SIZE                      equ 0001h
MAINPR_MAINPR1_LENGTH                    equ 0001h
MAINPR_MAINPR1_MASK                      equ 0002h
MAINPR_MAINPR2_POSN                      equ 0002h
MAINPR_MAINPR2_POSITION                  equ 0002h
MAINPR_MAINPR2_SIZE                      equ 0001h
MAINPR_MAINPR2_LENGTH                    equ 0001h
MAINPR_MAINPR2_MASK                      equ 0004h

// Register: DMA1PR
#define DMA1PR DMA1PR
DMA1PR                                   equ 039F3h
// bitfield definitions
DMA1PR_PR_POSN                           equ 0000h
DMA1PR_PR_POSITION                       equ 0000h
DMA1PR_PR_SIZE                           equ 0003h
DMA1PR_PR_LENGTH                         equ 0003h
DMA1PR_PR_MASK                           equ 0007h
DMA1PR_PR0_POSN                          equ 0000h
DMA1PR_PR0_POSITION                      equ 0000h
DMA1PR_PR0_SIZE                          equ 0001h
DMA1PR_PR0_LENGTH                        equ 0001h
DMA1PR_PR0_MASK                          equ 0001h
DMA1PR_PR1_POSN                          equ 0001h
DMA1PR_PR1_POSITION                      equ 0001h
DMA1PR_PR1_SIZE                          equ 0001h
DMA1PR_PR1_LENGTH                        equ 0001h
DMA1PR_PR1_MASK                          equ 0002h
DMA1PR_PR2_POSN                          equ 0002h
DMA1PR_PR2_POSITION                      equ 0002h
DMA1PR_PR2_SIZE                          equ 0001h
DMA1PR_PR2_LENGTH                        equ 0001h
DMA1PR_PR2_MASK                          equ 0004h
DMA1PR_DMA1PR_POSN                       equ 0000h
DMA1PR_DMA1PR_POSITION                   equ 0000h
DMA1PR_DMA1PR_SIZE                       equ 0003h
DMA1PR_DMA1PR_LENGTH                     equ 0003h
DMA1PR_DMA1PR_MASK                       equ 0007h
DMA1PR_DMA1PR0_POSN                      equ 0000h
DMA1PR_DMA1PR0_POSITION                  equ 0000h
DMA1PR_DMA1PR0_SIZE                      equ 0001h
DMA1PR_DMA1PR0_LENGTH                    equ 0001h
DMA1PR_DMA1PR0_MASK                      equ 0001h
DMA1PR_DMA1PR1_POSN                      equ 0001h
DMA1PR_DMA1PR1_POSITION                  equ 0001h
DMA1PR_DMA1PR1_SIZE                      equ 0001h
DMA1PR_DMA1PR1_LENGTH                    equ 0001h
DMA1PR_DMA1PR1_MASK                      equ 0002h
DMA1PR_DMA1PR2_POSN                      equ 0002h
DMA1PR_DMA1PR2_POSITION                  equ 0002h
DMA1PR_DMA1PR2_SIZE                      equ 0001h
DMA1PR_DMA1PR2_LENGTH                    equ 0001h
DMA1PR_DMA1PR2_MASK                      equ 0004h

