GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.inc
// Register: CCP4CAP
#define CCP4CAP CCP4CAP
CCP4CAP                                  equ 03F73h
// bitfield definitions
CCP4CAP_CTS_POSN                         equ 0000h
CCP4CAP_CTS_POSITION                     equ 0000h
CCP4CAP_CTS_SIZE                         equ 0008h
CCP4CAP_CTS_LENGTH                       equ 0008h
CCP4CAP_CTS_MASK                         equ 00FFh
CCP4CAP_CTS0_POSN                        equ 0000h
CCP4CAP_CTS0_POSITION                    equ 0000h
CCP4CAP_CTS0_SIZE                        equ 0001h
CCP4CAP_CTS0_LENGTH                      equ 0001h
CCP4CAP_CTS0_MASK                        equ 0001h
CCP4CAP_CTS1_POSN                        equ 0001h
CCP4CAP_CTS1_POSITION                    equ 0001h
CCP4CAP_CTS1_SIZE                        equ 0001h
CCP4CAP_CTS1_LENGTH                      equ 0001h
CCP4CAP_CTS1_MASK                        equ 0002h
CCP4CAP_CTS2_POSN                        equ 0002h
CCP4CAP_CTS2_POSITION                    equ 0002h
CCP4CAP_CTS2_SIZE                        equ 0001h
CCP4CAP_CTS2_LENGTH                      equ 0001h
CCP4CAP_CTS2_MASK                        equ 0004h
CCP4CAP_CCP4CTS_POSN                     equ 0000h
CCP4CAP_CCP4CTS_POSITION                 equ 0000h
CCP4CAP_CCP4CTS_SIZE                     equ 0008h
CCP4CAP_CCP4CTS_LENGTH                   equ 0008h
CCP4CAP_CCP4CTS_MASK                     equ 00FFh
CCP4CAP_CCP4CTS0_POSN                    equ 0000h
CCP4CAP_CCP4CTS0_POSITION                equ 0000h
CCP4CAP_CCP4CTS0_SIZE                    equ 0001h
CCP4CAP_CCP4CTS0_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS0_MASK                    equ 0001h
CCP4CAP_CCP4CTS1_POSN                    equ 0001h
CCP4CAP_CCP4CTS1_POSITION                equ 0001h
CCP4CAP_CCP4CTS1_SIZE                    equ 0001h
CCP4CAP_CCP4CTS1_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS1_MASK                    equ 0002h
CCP4CAP_CCP4CTS2_POSN                    equ 0002h
CCP4CAP_CCP4CTS2_POSITION                equ 0002h
CCP4CAP_CCP4CTS2_SIZE                    equ 0001h
CCP4CAP_CCP4CTS2_LENGTH                  equ 0001h
CCP4CAP_CCP4CTS2_MASK                    equ 0004h

// Register: CCPR3
#define CCPR3 CCPR3
CCPR3                                    equ 03F74h

// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 03F74h
// bitfield definitions
CCPR3L_RL_POSN                           equ 0000h
CCPR3L_RL_POSITION                       equ 0000h
CCPR3L_RL_SIZE                           equ 0008h
CCPR3L_RL_LENGTH                         equ 0008h
CCPR3L_RL_MASK                           equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 03F75h
// bitfield definitions
CCPR3H_RH_POSN                           equ 0000h
CCPR3H_RH_POSITION                       equ 0000h
CCPR3H_RH_SIZE                           equ 0008h
CCPR3H_RH_LENGTH                         equ 0008h
CCPR3H_RH_MASK                           equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 03F76h
// bitfield definitions
CCP3CON_MODE_POSN                        equ 0000h
CCP3CON_MODE_POSITION                    equ 0000h
CCP3CON_MODE_SIZE                        equ 0004h
CCP3CON_MODE_LENGTH                      equ 0004h
CCP3CON_MODE_MASK                        equ 000Fh
CCP3CON_FMT_POSN                         equ 0004h
CCP3CON_FMT_POSITION                     equ 0004h
CCP3CON_FMT_SIZE                         equ 0001h
CCP3CON_FMT_LENGTH                       equ 0001h
CCP3CON_FMT_MASK                         equ 0010h
CCP3CON_OUT_POSN                         equ 0005h
CCP3CON_OUT_POSITION                     equ 0005h
CCP3CON_OUT_SIZE                         equ 0001h
CCP3CON_OUT_LENGTH                       equ 0001h
CCP3CON_OUT_MASK                         equ 0020h
CCP3CON_EN_POSN                          equ 0007h
CCP3CON_EN_POSITION                      equ 0007h
CCP3CON_EN_SIZE                          equ 0001h
CCP3CON_EN_LENGTH                        equ 0001h
CCP3CON_EN_MASK                          equ 0080h
CCP3CON_MODE0_POSN                       equ 0000h
CCP3CON_MODE0_POSITION                   equ 0000h
CCP3CON_MODE0_SIZE                       equ 0001h
CCP3CON_MODE0_LENGTH                     equ 0001h
CCP3CON_MODE0_MASK                       equ 0001h
CCP3CON_MODE1_POSN                       equ 0001h
CCP3CON_MODE1_POSITION                   equ 0001h
CCP3CON_MODE1_SIZE                       equ 0001h
CCP3CON_MODE1_LENGTH                     equ 0001h
CCP3CON_MODE1_MASK                       equ 0002h
CCP3CON_MODE2_POSN                       equ 0002h
CCP3CON_MODE2_POSITION                   equ 0002h
CCP3CON_MODE2_SIZE                       equ 0001h
CCP3CON_MODE2_LENGTH                     equ 0001h
CCP3CON_MODE2_MASK                       equ 0004h
CCP3CON_MODE3_POSN                       equ 0003h
CCP3CON_MODE3_POSITION                   equ 0003h
CCP3CON_MODE3_SIZE                       equ 0001h
CCP3CON_MODE3_LENGTH                     equ 0001h
CCP3CON_MODE3_MASK                       equ 0008h
CCP3CON_CCP3MODE_POSN                    equ 0000h
CCP3CON_CCP3MODE_POSITION                equ 0000h
CCP3CON_CCP3MODE_SIZE                    equ 0004h
CCP3CON_CCP3MODE_LENGTH                  equ 0004h
CCP3CON_CCP3MODE_MASK                    equ 000Fh
CCP3CON_CCP3FMT_POSN                     equ 0004h
CCP3CON_CCP3FMT_POSITION                 equ 0004h
CCP3CON_CCP3FMT_SIZE                     equ 0001h
CCP3CON_CCP3FMT_LENGTH                   equ 0001h
CCP3CON_CCP3FMT_MASK                     equ 0010h
CCP3CON_CCP3OUT_POSN                     equ 0005h
CCP3CON_CCP3OUT_POSITION                 equ 0005h
CCP3CON_CCP3OUT_SIZE                     equ 0001h
CCP3CON_CCP3OUT_LENGTH                   equ 0001h
CCP3CON_CCP3OUT_MASK                     equ 0020h
CCP3CON_CCP3EN_POSN                      equ 0007h
CCP3CON_CCP3EN_POSITION                  equ 0007h
CCP3CON_CCP3EN_SIZE                      equ 0001h
CCP3CON_CCP3EN_LENGTH                    equ 0001h
CCP3CON_CCP3EN_MASK                      equ 0080h
CCP3CON_CCP3MODE0_POSN                   equ 0000h
CCP3CON_CCP3MODE0_POSITION               equ 0000h
CCP3CON_CCP3MODE0_SIZE                   equ 0001h
CCP3CON_CCP3MODE0_LENGTH                 equ 0001h
CCP3CON_CCP3MODE0_MASK                   equ 0001h
CCP3CON_CCP3MODE1_POSN                   equ 0001h
CCP3CON_CCP3MODE1_POSITION               equ 0001h
CCP3CON_CCP3MODE1_SIZE                   equ 0001h
CCP3CON_CCP3MODE1_LENGTH                 equ 0001h
CCP3CON_CCP3MODE1_MASK                   equ 0002h
CCP3CON_CCP3MODE2_POSN                   equ 0002h
CCP3CON_CCP3MODE2_POSITION               equ 0002h
CCP3CON_CCP3MODE2_SIZE                   equ 0001h
CCP3CON_CCP3MODE2_LENGTH                 equ 0001h
CCP3CON_CCP3MODE2_MASK                   equ 0004h
CCP3CON_CCP3MODE3_POSN                   equ 0003h
CCP3CON_CCP3MODE3_POSITION               equ 0003h
CCP3CON_CCP3MODE3_SIZE                   equ 0001h
CCP3CON_CCP3MODE3_LENGTH                 equ 0001h
CCP3CON_CCP3MODE3_MASK                   equ 0008h

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
CCP3CAP                                  equ 03F77h
// bitfield definitions
CCP3CAP_CTS_POSN                         equ 0000h
CCP3CAP_CTS_POSITION                     equ 0000h
CCP3CAP_CTS_SIZE                         equ 0008h
CCP3CAP_CTS_LENGTH                       equ 0008h
CCP3CAP_CTS_MASK                         equ 00FFh
CCP3CAP_CTS0_POSN                        equ 0000h
CCP3CAP_CTS0_POSITION                    equ 0000h
CCP3CAP_CTS0_SIZE                        equ 0001h
CCP3CAP_CTS0_LENGTH                      equ 0001h
CCP3CAP_CTS0_MASK                        equ 0001h
CCP3CAP_CTS1_POSN                        equ 0001h
CCP3CAP_CTS1_POSITION                    equ 0001h
CCP3CAP_CTS1_SIZE                        equ 0001h
CCP3CAP_CTS1_LENGTH                      equ 0001h
CCP3CAP_CTS1_MASK                        equ 0002h
CCP3CAP_CTS2_POSN                        equ 0002h
CCP3CAP_CTS2_POSITION                    equ 0002h
CCP3CAP_CTS2_SIZE                        equ 0001h
CCP3CAP_CTS2_LENGTH                      equ 0001h
CCP3CAP_CTS2_MASK                        equ 0004h
CCP3CAP_CCP3CTS_POSN                     equ 0000h
CCP3CAP_CCP3CTS_POSITION                 equ 0000h
CCP3CAP_CCP3CTS_SIZE                     equ 0008h
CCP3CAP_CCP3CTS_LENGTH                   equ 0008h
CCP3CAP_CCP3CTS_MASK                     equ 00FFh
CCP3CAP_CCP3CTS0_POSN                    equ 0000h
CCP3CAP_CCP3CTS0_POSITION                equ 0000h
CCP3CAP_CCP3CTS0_SIZE                    equ 0001h
CCP3CAP_CCP3CTS0_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS0_MASK                    equ 0001h
CCP3CAP_CCP3CTS1_POSN                    equ 0001h
CCP3CAP_CCP3CTS1_POSITION                equ 0001h
CCP3CAP_CCP3CTS1_SIZE                    equ 0001h
CCP3CAP_CCP3CTS1_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS1_MASK                    equ 0002h
CCP3CAP_CCP3CTS2_POSN                    equ 0002h
CCP3CAP_CCP3CTS2_POSITION                equ 0002h
CCP3CAP_CCP3CTS2_SIZE                    equ 0001h
CCP3CAP_CCP3CTS2_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS2_MASK                    equ 0004h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 03F78h

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 03F78h
// bitfield definitions
CCPR2L_RL_POSN                           equ 0000h
CCPR2L_RL_POSITION                       equ 0000h
CCPR2L_RL_SIZE                           equ 0008h
CCPR2L_RL_LENGTH                         equ 0008h
CCPR2L_RL_MASK                           equ 00FFh

