GopalSaraf/Practicals/PSDL/include/proc/pic18lf57k42.inc
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 7, b
#define IOCIF                            BANKMASK(PIR0), 7, b
#define IOCIP                            BANKMASK(IPR0), 7, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATF0                            BANKMASK(LATF), 0, a
#define LATF1                            BANKMASK(LATF), 1, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC1D1S0                          BANKMASK(CLC1SEL0), 0, b
#define LC1D1S1                          BANKMASK(CLC1SEL0), 1, b
#define LC1D1S2                          BANKMASK(CLC1SEL0), 2, b
#define LC1D1S3                          BANKMASK(CLC1SEL0), 3, b
#define LC1D1S4                          BANKMASK(CLC1SEL0), 4, b
#define LC1D1S5                          BANKMASK(CLC1SEL0), 5, b
#define LC1D1S6                          BANKMASK(CLC1SEL0), 6, b
#define LC1D1S7                          BANKMASK(CLC1SEL0), 7, b
#define LC1D2S0                          BANKMASK(CLC1SEL1), 0, b
#define LC1D2S1                          BANKMASK(CLC1SEL1), 1, b
#define LC1D2S2                          BANKMASK(CLC1SEL1), 2, b
#define LC1D2S3                          BANKMASK(CLC1SEL1), 3, b
#define LC1D2S4                          BANKMASK(CLC1SEL1), 4, b
#define LC1D2S5                          BANKMASK(CLC1SEL1), 5, b
#define LC1D2S6                          BANKMASK(CLC1SEL1), 6, b
#define LC1D2S7                          BANKMASK(CLC1SEL1), 7, b
#define LC1D3S0                          BANKMASK(CLC1SEL2), 0, b
#define LC1D3S1                          BANKMASK(CLC1SEL2), 1, b
#define LC1D3S2                          BANKMASK(CLC1SEL2), 2, b
#define LC1D3S3                          BANKMASK(CLC1SEL2), 3, b
#define LC1D3S4                          BANKMASK(CLC1SEL2), 4, b
#define LC1D3S5                          BANKMASK(CLC1SEL2), 5, b
#define LC1D3S6                          BANKMASK(CLC1SEL2), 6, b
#define LC1D3S7                          BANKMASK(CLC1SEL2), 7, b
#define LC1D4S0                          BANKMASK(CLC1SEL3), 0, b
#define LC1D4S1                          BANKMASK(CLC1SEL3), 1, b
#define LC1D4S2                          BANKMASK(CLC1SEL3), 2, b
#define LC1D4S3                          BANKMASK(CLC1SEL3), 3, b
#define LC1D4S4                          BANKMASK(CLC1SEL3), 4, b
#define LC1D4S5                          BANKMASK(CLC1SEL3), 5, b
#define LC1D4S6                          BANKMASK(CLC1SEL3), 6, b
#define LC1D4S7                          BANKMASK(CLC1SEL3), 7, b
#define LC1EN                            BANKMASK(CLC1CON), 7, b
#define LC1G1D1N                         BANKMASK(CLC1GLS0), 0, b
#define LC1G1D1T                         BANKMASK(CLC1GLS0), 1, b
#define LC1G1D2N                         BANKMASK(CLC1GLS0), 2, b
#define LC1G1D2T                         BANKMASK(CLC1GLS0), 3, b
#define LC1G1D3N                         BANKMASK(CLC1GLS0), 4, b
#define LC1G1D3T                         BANKMASK(CLC1GLS0), 5, b
#define LC1G1D4N                         BANKMASK(CLC1GLS0), 6, b
#define LC1G1D4T                         BANKMASK(CLC1GLS0), 7, b
#define LC1G1POL                         BANKMASK(CLC1POL), 0, b
#define LC1G2D1N                         BANKMASK(CLC1GLS1), 0, b
#define LC1G2D1T                         BANKMASK(CLC1GLS1), 1, b
#define LC1G2D2N                         BANKMASK(CLC1GLS1), 2, b
#define LC1G2D2T                         BANKMASK(CLC1GLS1), 3, b
#define LC1G2D3N                         BANKMASK(CLC1GLS1), 4, b
#define LC1G2D3T                         BANKMASK(CLC1GLS1), 5, b
#define LC1G2D4N                         BANKMASK(CLC1GLS1), 6, b
#define LC1G2D4T                         BANKMASK(CLC1GLS1), 7, b
#define LC1G2POL                         BANKMASK(CLC1POL), 1, b
#define LC1G3D1N                         BANKMASK(CLC1GLS2), 0, b
#define LC1G3D1T                         BANKMASK(CLC1GLS2), 1, b
#define LC1G3D2N                         BANKMASK(CLC1GLS2), 2, b
#define LC1G3D2T                         BANKMASK(CLC1GLS2), 3, b
#define LC1G3D3N                         BANKMASK(CLC1GLS2), 4, b
#define LC1G3D3T                         BANKMASK(CLC1GLS2), 5, b
#define LC1G3D4N                         BANKMASK(CLC1GLS2), 6, b
#define LC1G3D4T                         BANKMASK(CLC1GLS2), 7, b
#define LC1G3POL                         BANKMASK(CLC1POL), 2, b
#define LC1G4D1N                         BANKMASK(CLC1GLS3), 0, b
#define LC1G4D1T                         BANKMASK(CLC1GLS3), 1, b
#define LC1G4D2N                         BANKMASK(CLC1GLS3), 2, b
#define LC1G4D2T                         BANKMASK(CLC1GLS3), 3, b
#define LC1G4D3N                         BANKMASK(CLC1GLS3), 4, b
#define LC1G4D3T                         BANKMASK(CLC1GLS3), 5, b
#define LC1G4D4N                         BANKMASK(CLC1GLS3), 6, b
#define LC1G4D4T                         BANKMASK(CLC1GLS3), 7, b
#define LC1G4POL                         BANKMASK(CLC1POL), 3, b
#define LC1INTN                          BANKMASK(CLC1CON), 3, b
#define LC1INTP                          BANKMASK(CLC1CON), 4, b
#define LC1MODE0                         BANKMASK(CLC1CON), 0, b
#define LC1MODE1                         BANKMASK(CLC1CON), 1, b
#define LC1MODE2                         BANKMASK(CLC1CON), 2, b
#define LC1OE                            BANKMASK(CLC1CON), 6, b
#define LC1OUT                           BANKMASK(CLC1CON), 5, b
#define LC1POL                           BANKMASK(CLC1POL), 7, b
#define LC2                              BANKMASK(LATC), 2, a
#define LC2D1S0                          BANKMASK(CLC2SEL0), 0, b
#define LC2D1S1                          BANKMASK(CLC2SEL0), 1, b
#define LC2D1S2                          BANKMASK(CLC2SEL0), 2, b
#define LC2D1S3                          BANKMASK(CLC2SEL0), 3, b
#define LC2D1S4                          BANKMASK(CLC2SEL0), 4, b
#define LC2D1S5                          BANKMASK(CLC2SEL0), 5, b
#define LC2D1S6                          BANKMASK(CLC2SEL0), 6, b
#define LC2D1S7                          BANKMASK(CLC2SEL0), 7, b
#define LC2D2S0                          BANKMASK(CLC2SEL1), 0, b
#define LC2D2S1                          BANKMASK(CLC2SEL1), 1, b
#define LC2D2S2                          BANKMASK(CLC2SEL1), 2, b
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3, b
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4, b
#define LC2D2S5                          BANKMASK(CLC2SEL1), 5, b
#define LC2D2S6                          BANKMASK(CLC2SEL1), 6, b
#define LC2D2S7                          BANKMASK(CLC2SEL1), 7, b
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0, b
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1, b
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2, b
#define LC2D3S3                          BANKMASK(CLC2SEL2), 3, b
#define LC2D3S4                          BANKMASK(CLC2SEL2), 4, b
#define LC2D3S5                          BANKMASK(CLC2SEL2), 5, b
#define LC2D3S6                          BANKMASK(CLC2SEL2), 6, b
#define LC2D3S7                          BANKMASK(CLC2SEL2), 7, b
#define LC2D4S0                          BANKMASK(CLC2SEL3), 0, b
#define LC2D4S1                          BANKMASK(CLC2SEL3), 1, b
#define LC2D4S2                          BANKMASK(CLC2SEL3), 2, b
#define LC2D4S3                          BANKMASK(CLC2SEL3), 3, b
#define LC2D4S4                          BANKMASK(CLC2SEL3), 4, b
#define LC2D4S5                          BANKMASK(CLC2SEL3), 5, b
#define LC2D4S6                          BANKMASK(CLC2SEL3), 6, b
#define LC2D4S7                          BANKMASK(CLC2SEL3), 7, b
#define LC2EN                            BANKMASK(CLC2CON), 7, b
#define LC2G1D1N                         BANKMASK(CLC2GLS0), 0, b
#define LC2G1D1T                         BANKMASK(CLC2GLS0), 1, b
#define LC2G1D2N                         BANKMASK(CLC2GLS0), 2, b
#define LC2G1D2T                         BANKMASK(CLC2GLS0), 3, b
#define LC2G1D3N                         BANKMASK(CLC2GLS0), 4, b
#define LC2G1D3T                         BANKMASK(CLC2GLS0), 5, b
#define LC2G1D4N                         BANKMASK(CLC2GLS0), 6, b
#define LC2G1D4T                         BANKMASK(CLC2GLS0), 7, b
#define LC2G1POL                         BANKMASK(CLC2POL), 0, b
#define LC2G2D1N                         BANKMASK(CLC2GLS1), 0, b
#define LC2G2D1T                         BANKMASK(CLC2GLS1), 1, b
#define LC2G2D2N                         BANKMASK(CLC2GLS1), 2, b
#define LC2G2D2T                         BANKMASK(CLC2GLS1), 3, b
#define LC2G2D3N                         BANKMASK(CLC2GLS1), 4, b
#define LC2G2D3T                         BANKMASK(CLC2GLS1), 5, b
#define LC2G2D4N                         BANKMASK(CLC2GLS1), 6, b
#define LC2G2D4T                         BANKMASK(CLC2GLS1), 7, b
#define LC2G2POL                         BANKMASK(CLC2POL), 1, b
#define LC2G3D1N                         BANKMASK(CLC2GLS2), 0, b
#define LC2G3D1T                         BANKMASK(CLC2GLS2), 1, b
#define LC2G3D2N                         BANKMASK(CLC2GLS2), 2, b
#define LC2G3D2T                         BANKMASK(CLC2GLS2), 3, b
#define LC2G3D3N                         BANKMASK(CLC2GLS2), 4, b
#define LC2G3D3T                         BANKMASK(CLC2GLS2), 5, b
#define LC2G3D4N                         BANKMASK(CLC2GLS2), 6, b
#define LC2G3D4T                         BANKMASK(CLC2GLS2), 7, b
#define LC2G3POL                         BANKMASK(CLC2POL), 2, b
#define LC2G4D1N                         BANKMASK(CLC2GLS3), 0, b
#define LC2G4D1T                         BANKMASK(CLC2GLS3), 1, b
#define LC2G4D2N                         BANKMASK(CLC2GLS3), 2, b
#define LC2G4D2T                         BANKMASK(CLC2GLS3), 3, b
#define LC2G4D3N                         BANKMASK(CLC2GLS3), 4, b
#define LC2G4D3T                         BANKMASK(CLC2GLS3), 5, b
#define LC2G4D4N                         BANKMASK(CLC2GLS3), 6, b
#define LC2G4D4T                         BANKMASK(CLC2GLS3), 7, b
#define LC2G4POL                         BANKMASK(CLC2POL), 3, b
#define LC2INTN                          BANKMASK(CLC2CON), 3, b
#define LC2INTP                          BANKMASK(CLC2CON), 4, b
#define LC2MODE0                         BANKMASK(CLC2CON), 0, b
#define LC2MODE1                         BANKMASK(CLC2CON), 1, b
#define LC2MODE2                         BANKMASK(CLC2CON), 2, b
#define LC2OE                            BANKMASK(CLC2CON), 6, b
#define LC2OUT                           BANKMASK(CLC2CON), 5, b
#define LC2POL                           BANKMASK(CLC2POL), 7, b
#define LC3                              BANKMASK(LATC), 3, a
#define LC3D1S0                          BANKMASK(CLC3SEL0), 0, b
#define LC3D1S1                          BANKMASK(CLC3SEL0), 1, b
#define LC3D1S2                          BANKMASK(CLC3SEL0), 2, b
#define LC3D1S3                          BANKMASK(CLC3SEL0), 3, b
#define LC3D1S4                          BANKMASK(CLC3SEL0), 4, b
#define LC3D1S5                          BANKMASK(CLC3SEL0), 5, b
#define LC3D1S6                          BANKMASK(CLC3SEL0), 6, b
#define LC3D1S7                          BANKMASK(CLC3SEL0), 7, b
#define LC3D2S0                          BANKMASK(CLC3SEL1), 0, b
#define LC3D2S1                          BANKMASK(CLC3SEL1), 1, b
#define LC3D2S2                          BANKMASK(CLC3SEL1), 2, b
#define LC3D2S3                          BANKMASK(CLC3SEL1), 3, b
#define LC3D2S4                          BANKMASK(CLC3SEL1), 4, b
#define LC3D2S5                          BANKMASK(CLC3SEL1), 5, b
#define LC3D2S6                          BANKMASK(CLC3SEL1), 6, b
#define LC3D2S7                          BANKMASK(CLC3SEL1), 7, b
#define LC3D3S0                          BANKMASK(CLC3SEL2), 0, b
#define LC3D3S1                          BANKMASK(CLC3SEL2), 1, b
#define LC3D3S2                          BANKMASK(CLC3SEL2), 2, b
#define LC3D3S3                          BANKMASK(CLC3SEL2), 3, b
#define LC3D3S4                          BANKMASK(CLC3SEL2), 4, b
#define LC3D3S5                          BANKMASK(CLC3SEL2), 5, b
#define LC3D3S6                          BANKMASK(CLC3SEL2), 6, b
#define LC3D3S7                          BANKMASK(CLC3SEL2), 7, b
#define LC3D4S0                          BANKMASK(CLC3SEL3), 0, b
#define LC3D4S1                          BANKMASK(CLC3SEL3), 1, b
#define LC3D4S2                          BANKMASK(CLC3SEL3), 2, b
#define LC3D4S3                          BANKMASK(CLC3SEL3), 3, b
#define LC3D4S4                          BANKMASK(CLC3SEL3), 4, b
#define LC3D4S5                          BANKMASK(CLC3SEL3), 5, b
#define LC3D4S6                          BANKMASK(CLC3SEL3), 6, b
#define LC3D4S7                          BANKMASK(CLC3SEL3), 7, b
#define LC3EN                            BANKMASK(CLC3CON), 7, b
#define LC3G1D1N                         BANKMASK(CLC3GLS0), 0, b
#define LC3G1D1T                         BANKMASK(CLC3GLS0), 1, b
#define LC3G1D2N                         BANKMASK(CLC3GLS0), 2, b
#define LC3G1D2T                         BANKMASK(CLC3GLS0), 3, b
#define LC3G1D3N                         BANKMASK(CLC3GLS0), 4, b
#define LC3G1D3T                         BANKMASK(CLC3GLS0), 5, b
#define LC3G1D4N                         BANKMASK(CLC3GLS0), 6, b
#define LC3G1D4T                         BANKMASK(CLC3GLS0), 7, b
#define LC3G1POL                         BANKMASK(CLC3POL), 0, b
#define LC3G2D1N                         BANKMASK(CLC3GLS1), 0, b
#define LC3G2D1T                         BANKMASK(CLC3GLS1), 1, b
#define LC3G2D2N                         BANKMASK(CLC3GLS1), 2, b
#define LC3G2D2T                         BANKMASK(CLC3GLS1), 3, b
#define LC3G2D3N                         BANKMASK(CLC3GLS1), 4, b
#define LC3G2D3T                         BANKMASK(CLC3GLS1), 5, b
#define LC3G2D4N                         BANKMASK(CLC3GLS1), 6, b
#define LC3G2D4T                         BANKMASK(CLC3GLS1), 7, b
#define LC3G2POL                         BANKMASK(CLC3POL), 1, b
#define LC3G3D1N                         BANKMASK(CLC3GLS2), 0, b
#define LC3G3D1T                         BANKMASK(CLC3GLS2), 1, b
#define LC3G3D2N                         BANKMASK(CLC3GLS2), 2, b
#define LC3G3D2T                         BANKMASK(CLC3GLS2), 3, b
#define LC3G3D3N                         BANKMASK(CLC3GLS2), 4, b
#define LC3G3D3T                         BANKMASK(CLC3GLS2), 5, b
#define LC3G3D4N                         BANKMASK(CLC3GLS2), 6, b
#define LC3G3D4T                         BANKMASK(CLC3GLS2), 7, b
#define LC3G3POL                         BANKMASK(CLC3POL), 2, b
#define LC3G4D1N                         BANKMASK(CLC3GLS3), 0, b
#define LC3G4D1T                         BANKMASK(CLC3GLS3), 1, b
#define LC3G4D2N                         BANKMASK(CLC3GLS3), 2, b
#define LC3G4D2T                         BANKMASK(CLC3GLS3), 3, b
#define LC3G4D3N                         BANKMASK(CLC3GLS3), 4, b
#define LC3G4D3T                         BANKMASK(CLC3GLS3), 5, b
#define LC3G4D4N                         BANKMASK(CLC3GLS3), 6, b
#define LC3G4D4T                         BANKMASK(CLC3GLS3), 7, b
#define LC3G4POL                         BANKMASK(CLC3POL), 3, b
#define LC3INTN                          BANKMASK(CLC3CON), 3, b
#define LC3INTP                          BANKMASK(CLC3CON), 4, b
#define LC3MODE0                         BANKMASK(CLC3CON), 0, b
#define LC3MODE1                         BANKMASK(CLC3CON), 1, b
#define LC3MODE2                         BANKMASK(CLC3CON), 2, b
#define LC3OE                            BANKMASK(CLC3CON), 6, b
#define LC3OUT                           BANKMASK(CLC3CON), 5, b
#define LC3POL                           BANKMASK(CLC3POL), 7, b
#define LC4                              BANKMASK(LATC), 4, a
#define LC4D1S0                          BANKMASK(CLC4SEL0), 0, b
#define LC4D1S1                          BANKMASK(CLC4SEL0), 1, b
#define LC4D1S2                          BANKMASK(CLC4SEL0), 2, b
#define LC4D1S3                          BANKMASK(CLC4SEL0), 3, b
#define LC4D1S4                          BANKMASK(CLC4SEL0), 4, b
#define LC4D1S5                          BANKMASK(CLC4SEL0), 5, b
#define LC4D1S6                          BANKMASK(CLC4SEL0), 6, b
#define LC4D1S7                          BANKMASK(CLC4SEL0), 7, b
#define LC4D2S0                          BANKMASK(CLC4SEL1), 0, b
#define LC4D2S1                          BANKMASK(CLC4SEL1), 1, b
#define LC4D2S2                          BANKMASK(CLC4SEL1), 2, b
#define LC4D2S3                          BANKMASK(CLC4SEL1), 3, b
#define LC4D2S4                          BANKMASK(CLC4SEL1), 4, b
#define LC4D2S5                          BANKMASK(CLC4SEL1), 5, b
#define LC4D2S6                          BANKMASK(CLC4SEL1), 6, b
#define LC4D2S7                          BANKMASK(CLC4SEL1), 7, b
#define LC4D3S0                          BANKMASK(CLC4SEL2), 0, b
#define LC4D3S1                          BANKMASK(CLC4SEL2), 1, b
#define LC4D3S2                          BANKMASK(CLC4SEL2), 2, b
#define LC4D3S3                          BANKMASK(CLC4SEL2), 3, b
#define LC4D3S4                          BANKMASK(CLC4SEL2), 4, b
#define LC4D3S5                          BANKMASK(CLC4SEL2), 5, b
#define LC4D3S6                          BANKMASK(CLC4SEL2), 6, b
#define LC4D3S7                          BANKMASK(CLC4SEL2), 7, b
#define LC4D4S0                          BANKMASK(CLC4SEL3), 0, b
#define LC4D4S1                          BANKMASK(CLC4SEL3), 1, b
#define LC4D4S2                          BANKMASK(CLC4SEL3), 2, b
#define LC4D4S3                          BANKMASK(CLC4SEL3), 3, b
#define LC4D4S4                          BANKMASK(CLC4SEL3), 4, b
#define LC4D4S5                          BANKMASK(CLC4SEL3), 5, b
#define LC4D4S6                          BANKMASK(CLC4SEL3), 6, b
#define LC4D4S7                          BANKMASK(CLC4SEL3), 7, b
#define LC4EN                            BANKMASK(CLC4CON), 7, b
#define LC4G1D1N                         BANKMASK(CLC4GLS0), 0, b
#define LC4G1D1T                         BANKMASK(CLC4GLS0), 1, b
#define LC4G1D2N                         BANKMASK(CLC4GLS0), 2, b
